/*
 * 	ChatPlugin - A complete yet lightweight plugin which handles just too many features!
 * 	Copyright 2024  Remigio07
 * 	
 * 	This program is distributed in the hope that it will be useful,
 * 	but WITHOUT ANY WARRANTY; without even the implied warranty of
 * 	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * 	GNU Affero General Public License for more details.
 * 	
 * 	You should have received a copy of the GNU Affero General Public License
 * 	along with this program.  If not, see <https://www.gnu.org/licenses/>.
 * 	
 * 	<https://remigio07.me/chatplugin>
 */

package me.remigio07.chatplugin.server.chat.antispam;

public enum LeetLetter {
	
	A("4", "@", "α", "ἄ", "/\\", "/-\\", "^", "д", "à", "á", "â", "ã", "ä", "å", "ȧ", "ǎ", "ă", "ā", "ą", "ⱥ", "ấ", "ầ", "ắ", "ằ", "ǡ", "ǻ", "ǟ", "ẫ", "ẵ", "ả", "ȁ", "ȃ", "ẩ", "ẳ", "ạ", "ḁ", "ậ", "ặ", "𐌀", "ª", "ᵃ", "ₐ", "ₔ", "⁴", "₄", "ə", "ⓐ", "🅐", "𝖆"),
	B("8", "θ", "|3", "β", "ß", "ḃ", "ƀ", "ɓ", "ḅ", "ḇ", "ƃ", "ᵇ", "⁸", "₈", "฿", "ⓑ", "🅑", "𝖇", "𝕭", "𝕻"),
	D("|)", "[)", "ḋ", "ď", "ḑ", "đ", "ƌ", "ɗ", "ḍ", "ḓ", "ḏ", "ð", "ᵈ", "ⓓ", "🅓", "𝖉", "𝕯"),
	E("ξ", "3", "&", "£", "ε", "è", "é", "ê", "ë", "ė", "ě", "ĕ", "ē", "ẽ", "ę", "ȩ", "ɇ", "ế", "ề", "ḗ", "ḕ", "ễ", "ḝ", "ẻ", "ȅ", "ȇ", "ể", "ẹ", "ḙ", "ḛ", "ệ", "ᵉ", "ₑ", "³", "₃", "ⓔ", "🅔", "𝖊"),
	F("ḟ", "ƒ", "ᶠ", "ⓕ", "🅕"),
	G("6", "9", "ǵ", "ġ", "ĝ", "ǧ", "ğ", "ḡ", "ģ", "ǥ", "ɠ", "ᵍ", "⁶", "⁹", "₆", "₉", "ⓖ", "🅖", "𝖌"),
	H("#", "]-[", "|-|", "ḣ", "ĥ", "ḧ", "ȟ", "ḩ", "ħ", "ḥ", "ḫ", "ⱨ", "ʰ", "ₕ", "ⓗ", "🅗", "𝖍"),
	J("ĵ", "ǰ", "ɉ", "ʲ", "ⱼ", "ⓙ", "🅙", "𝖏", "𝕵"),
	K("|<", "|{", "κ", "ᵏ", "ₖ", "ḱ", "ǩ", "ķ", "ƙ", "ḳ", "ḵ", "ⱪ", "ĸ", "|‹", "ⓚ", "🅚"),
	M("/\\/\\", "/v\\", "|\\/|", "|v|", "ᵐ", "ₘ", "ḿ", "ṁ", "ṃ", "₥", "ⓜ", "🅜", "𝖒", "𝕸"),
	O("0", "()", "[]", "ø", "ó", "ò", "ȯ", "ô", "ö", "ǒ", "ŏ", "ō", "õ", "ǫ", "ő", "ố", "ồ", "σ", "º", "ᵒ", "ₒ", "⁰", "₀", "°", "⁽⁾", "∅", "¤", "ⓞ", "🅞", "𝖔", "𝕺"),
	P("⁋", "ρ", "℗", "|*", "|°", "ᵖ", "ₚ", "þ", "₱", "ⓟ", "🅟", "𝖕"),
	Q("2", "¶", "ⓠ", "🅠", "ᑫ", "𝖖", "𝕼"),
	R("я", "®", "|2", "ԇ", "ʳ", "ᵣ", "ŗ", "ř", "ⓡ", "🅡", "𝕽"),
	S("5", "ş", "$", "ˢ", "ₛ", "⁵", "₅", "š", "ⓢ", "🅢"),
	T("7", "τ", "+", "†", "ţ", "ᵗ", "ₜ", "⁷", "₇", "ŧ", "ť", "ẗ", "ⓣ", "🅣", "𝖙"),
	W("\\/\\/", "vv", "\\^/", "\\v/", "\\x/", "\\|/", "\\\\//", "₩", "ш", "щ", "ω", "𝓌", "ʷ", "ẘ", "ẅ", "ⓦ", "🅦"),
	X("χ", "×", "><", "}{", ")(", "*", "ˣ", "ₓ", "ẍ", "›‹", "ⓧ", "🅧"),
	Y("γ", "ч", "`/", "¥", "j", "ý", "ỳ", "ẏ", "ŷ", "ÿ", "ȳ", "ỹ", "ẙ", "ɏ", "ỷ", "ỵ", "ʸ", "ᵧ", "ⓨ", "🅨"),
	Z("ζ", "2", "%", "ᶻ", "²", "₂", "ž", "𝓏", "ⓩ", "🅩"),
	C("(", "<", "[", "©", "¢", "ç", "ć", "ċ", "ĉ", "č", "ȼ", "ḉ", "ƈ", "⁽", "‹", "₡", "ᶜ", "ⓒ", "🄯", "🄫", "🅒", "𝖈"),
	N("/\\/", "и", "ท ", "ǹ", "ń", "ñ", "ň", "ṅ", "ņ", "ɲ", "ƞ", "ṇ", "ṋ", "ṉ", "ŋ", "ⁿ", "ₙ", "ⓝ", "🅝", "𝖓"),
	V("\\/", "√", "ᵛ", "ᵥ", "ⓥ", "🅥"),
	U("v", "υ", "ù", "ú", "û", "ü", "|_|", "(_)", "µ", "ᵘ", "ᵤ", "บ ", "ű", "ǔ", "ų", "ŭ", "ū", "ů", "ǖ", "ǘ", "ǚ", "ǜ", "ⓤ", "🅤", "𝖚", "𝖀"),
	L("|_", "ĺ", "ŀ", "ľ", "ⱡ", "ļ", "ƚ", "ł", "ḷ", "ḽ", "ḻ", "ḹ", "ˡ", "ₗ", "ⓛ", "🅛", "𝖑"),
	I("ι", "1", "!", "|", "┃", "╏", "╎", "┇", "︱", "┊", "︳", "┋", "┆", "í", "ì", "ı", "î", "ï", "ǐ", "ĭ", "ī", "ĩ", "į", "ɨ", "ḯ", "ỉ", "ȉ", "ȋ", "ị", "ḭ", "ⁱ", "ᵢ", "¹", "₁", "¡", "ⓘ", "🅘", "𝖎");
	
	private String[] replacements;
	
	private LeetLetter(String... replacements) {
		this.replacements = replacements;
	}
	
	public String[] getReplacements() {
		return replacements;
	}
	
	public String replace(String input) {
		for (String replacement : replacements)
			input = input.replace(replacement, name());
		return input;
	}
	
}
