/*
 * 	ChatPlugin - A complete yet lightweight plugin which handles just too many features!
 * 	Copyright 2024  Remigio07
 * 	
 * 	This program is distributed in the hope that it will be useful,
 * 	but WITHOUT ANY WARRANTY; without even the implied warranty of
 * 	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * 	GNU Affero General Public License for more details.
 * 	
 * 	You should have received a copy of the GNU Affero General Public License
 * 	along with this program.  If not, see <https://www.gnu.org/licenses/>.
 * 	
 * 	<https://remigio07.me/chatplugin>
 */

package me.remigio07.chatplugin.server.chat.antispam;

public enum LeetLetter {
	
	B("8", "|3", "β", "ß", "ɞ", "ɮ", "в", "ȝ", "ϧ", "ъ", "ь", "ҍ", "ḃ", "ƀ", "ɓ", "ḅ", "ḇ", "ƃ", "Ƅ", "ᵇ", "⁸", "₈", "฿", "ⓑ", "🅑", "𝖇", "𝕭", "𝕻", "ʙ", "𝐛", "𝐁", "𝘣", "𝘉", "𝓫", "ℬ"),
	D("|)", "[)", "ḋ", "ď", "ḑ", "đ", "ԁ", "ƌ", "ɗ", "ḍ", "ḓ", "ḏ", "ð", "ɖ", "ͩ", "ᵈ", "ⓓ", "🅓", "𝖉", "𝕯", "ᴅ", "𝐝", "𝐃", "𝘥", "𝘋", "𝓭", "𝒟"),
	E("ξ", "3", "&", "€", "£", "ҽ", "ҿ", "ӗ", "ѐ", "ё", "è", "é", "ê", "ë", "ė", "ě", "ĕ", "ē", "ẽ", "ę", "ȩ", "ɇ", "ế", "ề", "ḗ", "ḕ", "ễ", "ḝ", "ẻ", "ȅ", "ȇ", "ể", "ẹ", "ḙ", "ḛ", "ệ", "ǯ", "ξ", "е", "ǝ", "з", "ε", "ɛ", "ԑ", "έ", "є", "ʒ", "ӡ", "ƹ", "ҙ", "ɜ", "ɝ", "э", "ӟ", "ӭ", "ɘ", "ͤ", "ᵉ", "ₑ", "³", "₃", "ⓔ", "🅔", "𝖊", "ᴇ", "𝐞", "𝐄", "𝘦", "𝘌", "𝓮", "ℰ"),
	F("ḟ", "ƒ", "ϝ", "բ", "ғ", "ᶠ", "ⓕ", "🅕", "ꜰ", "𝐟", "𝐅", "𝘧", "𝘍", "𝓯", "ℱ"),
	G("6", "9", "ǵ", "ġ", "ĝ", "ǧ", "ğ", "ḡ", "ģ", "ǥ", "ɠ", "ɡ", "ց", "ԍ", "ʛ", "ƍ", "ᵍ", "⁶", "⁹", "₆", "₉", "ⓖ", "🅖", "𝖌", "ᴳ", "ɢ", "𝐠", "𝐆", "𝘨", "𝘎", "𝓰", "𝒢"),
	H("#", "]-[", "|-|", "н", "ḣ", "ĥ", "ḧ", "ȟ", "ḩ", "ħ", "ћ", "ḥ", "ḫ", "հ", "ⱨ", "ɦ", "ɧ", "һ", "ӈ", "ԩ", "ӊ", "Η", "ң", "ҥ", "ʎ", "ͪ", "ʰ", "ₕ", "ⓗ", "🅗", "𝖍", "ʜ", "𝐡", "𝐇", "𝘩", "𝘏", "𝓱", "ℋ"),
	J("ĵ", "ǰ", "ɉ", "ʝ", "յ", "ȷ", "ϳ", "ј", "ʲ", "ⱼ", "ⓙ", "🅙", "𝖏", "𝕵", "ᴊ", "𝐣", "𝐉", "𝘫", "𝘑", "𝓳", "𝒥"),
	K("|<", "|{", "κ", "к", "қ", "ҟ", "ҡ", "ҝ", "ᵏ", "ₖ", "ќ", "ḱ", "ǩ", "ķ", "ƙ", "ḳ", "ḵ", "ⱪ", "ĸ", "Ϗ", "|‹", "ⓚ", "🅚", "ᴋ", "𝐤", "𝐊", "𝘬", "𝘒", "𝓴", "𝒦"),
	O("0", "()", "[]", "ø", "ǿ", "ɸ", "Φ", "ʘ", "Θ", "ѳ", "ө", "ѻ", "ϙ", "օ", "о", "ο", "ӧ", "ό", "ó", "ò", "ȯ", "ô", "ö", "ǒ", "ŏ", "ō", "õ", "ǫ", "ǭ", "ő", "ố", "ồ", "ȍ", "ȏ", "ȫ", "ȭ", "ȱ", "σ", "ơ", "ͦ", "º", "ᵒ", "ₒ", "⁰", "₀", "°", "⁽⁾", "∅", "¤", "ⓞ", "🅞", "𝖔", "𝕺", "ᴏ", "𝐨", "𝐎", "𝘰", "𝘖", "𝓸", "𝒪"),
	P("⁋", "ρ", "ƿ", "р", "℗", "|*", "|°", "ᵖ", "ₚ", "þ", "ƥ", "ҏ", "թ", "₱", "ⓟ", "🅟", "𝖕", "ᴘ", "𝐩", "𝐏", "𝘱", "𝘗", "𝓹", "𝒫"),
	Q("2", "¶", "ɋ", "ⓠ", "🅠", "ᑫ", "𝖖", "𝕼", "ʠ", "q", "ԛ", "գ", "զ", "𝐪", "𝐐", "𝘲", "𝘘", "𝓺", "𝒬"),
	R("я", "®", "|2", "ԇ", "ͬ", "ʳ", "ᵣ", "ŗ", "ř", "ŕ", "ȑ", "ȓ", "ɍ", "ɼ", "ɽ", "ɾ", "ʁ", "ⓡ", "🅡", "𝕽", "ʀ", "𝐫", "𝐑", "𝘳", "𝘙", "𝓻", "ℛ"),
	S("5", "ƽ", "ş", "$", "ʃ", "Տ", "ˢ", "ₛ", "⁵", "₅", "š", "ś", "ŝ", "ș", "ȿ", "ʂ", "ѕ", "ⓢ", "🅢", "ꜱ", "𝐬", "𝐒", "𝘴", "𝘚", "𝓼", "𝒮", "ᶳ"),
	T("7", "ԏ", "τ", "+", "†", "ͳ", "т", "ţ", "ⱦ", "ҭ", "ȶ", "ե", "ƚ", "ͭ", "ᵗ", "ₜ", "⁷", "₇", "ŧ", "ť", "ẗ", "ƫ", "ƭ", "ʈ", "ț", "ⓣ", "🅣", "𝖙", "ᴛ", "𝐭", "𝐓", "𝘵", "𝘛", "𝓽", "𝒯"),
	W("\\/\\/", "vv", "\\^/", "\\v/", "\\x/", "\\\\//", "₩", "ш", "ɯ", "ա", "ѡ", "ԝ", "պ", "ɰ", "щ", "ω", "ώ", "ѿ", "𝓌", "ʷ", "ẘ", "ẅ", "ŵ", "ⓦ", "🅦", "ᴡ", "𝐰", "𝐖", "𝘸", "𝘞", "𝔀", "𝒲"),
	X("χ", "ҳ", "×", "х", "ӽ", "ӿ", "><", "}{", ")(", "*", "ͯ", "˟", "ˣ", "ₓ", "ẍ", "›‹", "ⓧ", "🅧", "𝐱", "𝐗", "𝘹", "𝘟", "𝔁", "𝒳"),
	Y("γ", "ү", "ұ", "ч", "ӵ", "`/", "¥", "ϒ", "ϓ", "џ", "ϔ", "у", "j", "ӳ", "ӱ", "ӯ", "ў", "ý", "ỳ", "ẏ", "ŷ", "ÿ", "ȳ", "ỹ", "ẙ", "ɏ", "ỷ", "ỵ", "ƴ", "ʸ", "ᵧ", "ⓨ", "🅨", "ʏ", "𝐲", "𝐘", "𝘺", "𝘠", "𝔂", "𝒴"),
	Z("ζ", "2", "ƻ", "%", "ᶻ", "²", "₂", "ž", "ź", "ż", "ƨ", "ƶ", "ȥ", "ɀ", "ʐ", "𝓏", "ⓩ", "🅩", "ᴢ", "𝐳", "𝐙", "𝘻", "𝘡", "𝔃", "𝒵"),
	C("(", "<", "[", "©", "¢", "ç", "ҫ", "ć", "ċ", "ĉ", "č", "ȼ", "ḉ", "ƈ", "ʗ", "ϲ", "с", "⁽", "‹", "₡", "ɔ", "ͻ", "ͨ", "ᶜ", "ⓒ", "🄯", "🄫", "🅒", "𝖈", "ᴄ", "𝐜", "𝐂", "𝘤", "𝘊", "𝓬", "𝒞"),
	M("/\\/\\", "/v\\", "|\\/|", "|v|", "м", "Μ", "ӎ", "ϻ", "ͫ", "ᵐ", "ₘ", "ḿ", "ṁ", "ṃ", "ՠ", "ɱ", "₥", "ʍ", "ⓜ", "🅜", "𝖒", "𝕸", "ᴍ", "𝐦", "𝐌", "𝘮", "𝘔", "𝓶", "ℳ"),
	N("/\\/", "|\\|", "ո", "и", "й", "ҋ", "ӣ", "ӥ", "ͷ", "ท ", "ѝ", "Ν", "ǹ", "ń", "ñ", "ň", "ṅ", "ņ", "ŉ", "ղ", "ɲ", "ր", "ƞ", "դ", "ή", "ṇ", "ṋ", "ṉ", "ŋ", "ɳ", "ȵ", "ⁿ", "ₙ", "ⓝ", "🅝", "𝖓", "ɴ", "𝐧", "𝐍", "𝘯", "𝘕", "𝓷", "𝒩"),
	V("\\/", "√", "ѵ", "ѷ", "Ɣ", "ɤ", "ͮ", "ᵛ", "ᵥ", "ⓥ", "🅥", "ᴠ", "𝐯", "𝐕", "𝘷", "𝘝", "𝓿", "𝒱"),
	A("4", "@", "а", "α", "ά", "ἄ", "/\\", "/-\\", "^", "ʌ", "Δ", "Λ", "ɐ", "ә", "ɑ", "д", "ӛ", "ӑ", "ӓ", "à", "á", "â", "ã", "ä", "å", "ȧ", "ǎ", "ă", "ā", "ą", "ⱥ", "ấ", "ầ", "ắ", "ằ", "ǡ", "ǻ", "ǟ", "ẫ", "ẵ", "ả", "ȁ", "ȃ", "ẩ", "ẳ", "ạ", "ḁ", "ậ", "ặ", "𐌀", "ͣ", "ª", "ᵃ", "ₐ", "ₔ", "⁴", "₄", "ə", "ɚ", "ⓐ", "🅐", "𝖆", "ᴀ", "𝐚", "𝐀", "𝘢", "𝘈", "𝓪", "𝒜"),
	U("v", "υ", "ύ", "ϋ", "ΰ", "ù", "ú", "û", "ü", "ư", "մ", "ц", "|_|", "(_)", "ս", "ʊ", "ʋ", "ͧ", "ᵘ", "ᵤ", "บ ", "ű", "ũ", "ǔ", "ų", "ŭ", "ū", "ů", "ǖ", "ǘ", "ǚ", "ǜ", "ȕ", "ȗ", "ʉ", "ⓤ", "🅤", "𝖚", "𝖀", "ᴜ", "𝐮", "𝐔", "𝘶", "𝘜", "𝓾", "𝒰"),
	L("|_", "ĺ", "ŀ", "ľ", "ⱡ", "ļ", "ł", "ḷ", "ḽ", "ḻ", "ḹ", "ɭ", "ւ", "լ", "ˡ", "ₗ", "ⓛ", "🅛", "𝖑", "ʟ", "𝐥", "𝐋", "𝘭", "𝘓", "𝓵", "ℒ"),
	I("ι", "1", "!", "ǃ", "|", "ǀ", "┃", "¦", "╏", "╎", "┇", "︱", "┊", "︳", "┋", "┆", "ӏ", "і", "ї", "ϊ", "ΐ", "ί", "í", "ì", "ɩ", "ı", "î", "ï", "ǐ", "ĭ", "ī", "ĩ", "į", "ɨ", "ḯ", "ỉ", "ȉ", "ȋ", "ị", "ḭ", "ͥ", "ⁱ", "ᵢ", "¹", "₁", "¡", "ⓘ", "🅘", "𝖎", "ɪ", "𝐢", "𝐈", "𝘪", "𝘐", "𝓲", "ℐ");
	
	private String[] replacements;
	
	private LeetLetter(String... replacements) {
		this.replacements = replacements;
	}
	
	public String[] getReplacements() {
		return replacements;
	}
	
	public String replace(String input) { // for the future - different replacements for lower and upper case
		for (String replacement : replacements)
			input = input.replace(replacement, name().toLowerCase()).replace(replacement.toUpperCase(), name());
		return input;
	}
	
}
