/*
 * 	ChatPlugin - A complete yet lightweight plugin which handles just too many features!
 * 	Copyright 2024  Remigio07
 * 	
 * 	This program is distributed in the hope that it will be useful,
 * 	but WITHOUT ANY WARRANTY; without even the implied warranty of
 * 	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * 	GNU Affero General Public License for more details.
 * 	
 * 	You should have received a copy of the GNU Affero General Public License
 * 	along with this program.  If not, see <https://www.gnu.org/licenses/>.
 * 	
 * 	<https://remigio07.me/chatplugin>
 */

package me.remigio07.chatplugin.server.chat.antispam;

public enum LeetLetter {
	
	A("4", "@", "α", "ἄ", "/\\", "/-\\", "^", "д", "à", "á", "â", "ã", "ä", "å", "ȧ", "ǎ", "ă", "ā", "ą", "ⱥ", "ấ", "ầ", "ắ", "ằ", "ǡ", "ǻ", "ǟ", "ẫ", "ẵ", "ả", "ȁ", "ȃ", "ẩ", "ẳ", "ạ", "ḁ", "ậ", "ặ", "𐌀", "ª", "⁴", "₄", "ə", "ⓐ", "🅐"),
	B("8", "θ", "|3", "β", "ß", "ḃ", "ƀ", "ɓ", "ḅ", "ḇ", "ƃ", "⁸", "₈", "฿", "ⓑ", "🅑"),
	D("|)", "[)", "ḋ", "ď", "ḑ", "đ", "ƌ", "ɗ", "ḍ", "ḓ", "ḏ", "ð", "ⓓ", "🅓"),
	E("ξ", "3", "&", "£", "ε", "è", "é", "ê", "ë", "ė", "ě", "ĕ", "ē", "ẽ", "ę", "ȩ", "ɇ", "ế", "ề", "ḗ", "ḕ", "ễ", "ḝ", "ẻ", "ȅ", "ȇ", "ể", "ẹ", "ḙ", "ḛ", "ệ", "³", "₃", "ⓔ", "🅔"),
	F("ḟ", "ƒ", "ⓕ", "🅕"),
	G("6", "9", "ǵ", "ġ", "ĝ", "ǧ", "ğ", "ḡ", "ģ", "ǥ", "ɠ", "⁶", "⁹", "₆", "₉", "ⓖ", "🅖"),
	H("#", "]-[", "|-|", "ḣ", "ĥ", "ḧ", "ȟ", "ḩ", "ħ", "ḥ", "ḫ", "ⱨ", "ʰ", "ⓗ", "🅗"),
	I("ι", "1", "!", "í", "ì", "ı", "î", "ï", "ǐ", "ĭ", "ī", "ĩ", "į", "ɨ", "ḯ", "ỉ", "ȉ", "ȋ", "ị", "ḭ", "ⁱ", "¹", "₁", "¡", "ⓘ", "🅘"),
	J("ĵ", "ǰ", "ɉ", "ʲ", "ⓙ", "🅙"),
	K("|<", "|{", "κ", "ḱ", "ǩ", "ķ", "ƙ", "ḳ", "ḵ", "ⱪ", "ĸ", "|‹", "ⓚ", "🅚"),
	M("/\\/\\", "/v\\", "|\\/|", "|v|", "ḿ", "ṁ", "ṃ", "₥", "ⓜ", "🅜"),
	O("0", "()", "[]", "ø", "ó", "ò", "ȯ", "ô", "ö", "ǒ", "ŏ", "ō", "õ", "ǫ", "ő", "ố", "ồ", "σ", "º", "⁰", "₀", "°", "⁽⁾", "∅", "¤", "ⓞ", "🅞"),
	P("⁋", "ρ", "℗", "|*", "|°", "þ", "₱", "ⓟ", "🅟"),
	Q("2", "¶", "ⓠ", "🅠"),
	R("я", "®", "|2", "ԇ", "ʳ", "ŗ", "ř", "ⓡ", "🅡"),
	S("5", "ş", "§", "$", "ˢ", "⁵", "₅", "š", "ⓢ", "🅢"),
	T("7", "τ", "+", "†", "ţ", "⁷", "₇", "ŧ", "ť", "ẗ", "ⓣ", "🅣"),
	U("υ", "ù", "ú", "û", "ü", "|_|", "(_)", "µ", "บ ", "ű", "ǔ", "ų", "ŭ", "ū", "ů", "ǖ", "ǘ", "ǚ", "ǜ", "ⓤ", "🅤"),
	W("\\/\\/", "vv", "\\^/", "\\v/", "\\x/", "\\|/", "\\\\//", "₩", "ш", "щ", "ω", "ʷ", "ẘ", "ẅ", "ⓦ", "🅦"),
	X("χ", "×", "><", "}{", ")(", "*", "ˣ", "ẍ", "›‹", "ⓧ", "🅧"),
	Y("γ", "ч", "`/", "¥", "j", "ý", "ỳ", "ẏ", "ŷ", "ÿ", "ȳ", "ỹ", "ẙ", "ɏ", "ỷ", "ỵ", "ʸ", "ⓨ", "🅨"),
	Z("ζ", "2", "%", "²", "₂", "ž", "ⓩ", "🅩"),
	C("(", "<", "[", "©", "¢", "ç", "ć", "ċ", "ĉ", "č", "ȼ", "ḉ", "ƈ", "⁽", "‹", "₡", "ⓒ", "🄯", "🄫", "🅒"),
	L("|_", "|", "ĺ", "ŀ", "ľ", "ⱡ", "ļ", "ƚ", "ł", "ḷ", "ḽ", "ḻ", "ḹ", "ˡ", "ⓛ", "🅛"),
	N("/\\/", "и", "ท ", "ǹ", "ń", "ñ", "ň", "ṅ", "ņ", "ɲ", "ƞ", "ṇ", "ṋ", "ṉ", "ŋ", "ⁿ", "ⓝ", "🅝"),
	V("\\/", "√", "ⓥ", "🅥");
	
	private String[] replacements;
	
	private LeetLetter(String... replacements) {
		this.replacements = replacements;
	}
	
	public String[] getReplacements() {
		return replacements;
	}
	
	public String replace(String input) {
		for (String replacement : replacements)
			input = input.replace(replacement, name());
		return input;
	}
	
}
